[
  {
    "id": 1,
    "title": "Sgt. Pepper's Lonely Hearts Club Band",
    "artist": "The Beatles",
    "artwork": "https://img.discogs.com/5niM71_Gc3Zkk6VK4cRlpHpQRIY=/fit-in/600x590/filters:strip_icc():format(jpeg):mode_rgb():quality(90)/discogs-images/R-499497-1456047383-9489.jpeg.jpg",
    "rating": 85,
    "releaseDate": "1967-05-26",
    "reviewDate": "2021-03-25",
    "reviewTitle": "Lightning in a bottle",
    "reviewBody": "Undoubtably one of the greatest albums to ever exist. Does it need an introduction? No. But I'll try my best anyway... This album captured the essense of the culture of the 60s, reflecting the feelings and ideas of the first post-WW2 teen audience, a generation which had grown out of their poster covered bedrooms in their parent's houses since the early Beatles' albums, and quite literally matured into the freewheeling hippy movement for most of Europe and America, marking a dramatic political-shift toward supporting humanitarian growth through charitable taxation and socialist ideologies, which is perfectly encapsulated in the mood of \"With A Little Help From My Friends\" and \"Getting Better\". The album is layered to appear on the outside as warm escapism, with songs like \"Being For The Benefit Of My. Kite !\" and \"Lucy In The Sky With Diamonds\" presenting a surreal and almost comedic representation of love and happiness, but, like a (glass) onion, this layer can be peeled back to reveal a darker theme of the album: Lurking existentialism and mortality in songs like \"Fixing A Hole\", with the lyrics: \"Fixing a hole where the rain gets in, stops my mind from wondering where it will go\", where \"it\" is a double-entendre, relating to both the physical rain Paul is talking about, and one's own concioussness. Yet another layer is embedded through the idea of sharing and overcoming struggle, driven deep into its foundations, a message which clearly resonated with young people in an era of historic civil changes in the United States and like-wise around the world. While these heavier topics are definitely present within some songs, through their composition and lyrics (which are talked about in more detail in the individual song reviews), the album does an amazing job of presenting a promise of a fallback of hope, love and happiness, all of which exists ephemerally within each track, and the album itself, acting as a landing cushion from the heartache related to the heavier topics in the album, but the message is so strongly presented that it will certainly have a everlasting impact on those that are truly listening.",
    "tracks": [
      {
        "title": "Sgt Pepper's Lonely Hearts Club Band",
        "yt-id": "xwwABrNLvFs",
        "rating": 70,
        "reviewTitle": "Perfectly introduces the album",
        "reviewBody": "The lyrics present a vivid description of a fictional band's story. Where they've been and where they're going: \"they've been going in and out of style\", setting up a perspective of time within the context of the album and the band; of coming and going, of seeings and forgetting, and reassurance that while all things must pass it'll be okay. This is a theme that is called back upon throughout the entire album, and I would personally consider it to be the most important elements used to mellow the darkest points of the album. Paul bursts dramatically through at end of the first verse: \"The act you've known for all these years: Sgt Pepper's Lonely Hearts Club Band!\", begging the question: \"have I known them all these years?\" - well the answer is yes and no. To me, the \"band\" is a personification (John and Paul loved metaphors) of THE story. With countless other Beatles tracks having strong religious meaning (\"The Word\", \"Something\"), and \"going in and out of style\" possibly being a subtle reference to the pendulum-like popularity of religion within society. While it isn't specifically used to ignite a spiritual response from the listener, it does add another dimension to the story through the reference to The Bible and its countless stories, allegories and moral messages of overcoming evil and welcoming acceptance and forgiveness. Stories so timeless and endlessly re-imagined that in a way every listener should already know \"the band\" through another work, inviting a feeling of inclusivity which is utilised perfectly to comfort the listener. The first verse is followed by independent instruments and sound effects which clash to create a pleasing dissonance, and then struck down eagerly by the harmony of the chorus. The listener is told to \"Sit back and let the evening go\", reminding them, as mentioned previously, of the passivity of the album, and of life itself, and again gently pushing peace and acceptance into the mind of the listener."
      },
      {
        "title": "With A Little Help From My Friends",
        "yt-id": "0C58ttB2-Qg",
        "rating": 80,
        "reviewTitle": "A classic song about love and friendship. Or is it?",
        "reviewBody": "Carrying the momentum of the first track, and surprisingly sung by Ringo, \"With A Little Help From My Friends\" tells the story of a lonely narrator who's lover, or love itself, has \"gone away\", and wondering how to cope with this loss. The backing vocals, through the use of call and response (asking and answering), could be the friends of the narrator giving advice, or as I suspect (as this song was written for Ringo by John and Paul), a metaphoric representation of the narrator's imagination and thoughts, i.e. the voice in his head. Both these ideas are equally plausible, until oddly a deeper question comes from the backing vocals: \"What do you see when you turn out the lights?\", answered by the narrator with: \"I can't tell you, but I know it's mine\", the question is avoided, as if \"it\" is a burden laying so heavily upon the narrator's shoulders that a mere mention of it would create infinitely more problems; \"I know it's mine\" - as in \"my problem, and mine alone\". This indicates that this issue is greatly important to the narrator, and avoidance of the answer shows that it is likely something he wouldn't speak about to his friends. So why would the narrator's friends ask such a personal question about an unknown unknown, of which they have no knowledge of? Furthermore the repetitive nature of this line within the song, although can be reduced to \"all lyrics are repetitive\", could be a hint at ruminating thoughts, reoccurring in the concious part of the mind. This song could be interpreted quite deeply as a song about regret and handling psychological turmoil... or it could just be about a narrator who's lost love, or who's lover is out of town. It's a mystery."
      },
      {
        "title": "Lucy In The Sky With Diamonds",
        "yt-id": "naoknj1ebqI",
        "rating": 75,
        "reviewTitle": "Timeless psychedelic Rock Anthem",
        "reviewBody": "Invoking ideas of surrealism by pairing experimentally layered instruments (previously pioneered by The Beach Boys a year earlier on their album Pet Sounds) and psychedelic lyrics Lennon says were inspired by Alice in Wonderland, the song struck a chord with its audience because of the escapism it represented, offering a form of transcendance and transformation from a society which teens seemingly viewed as antiquated, and traditions that had previously been tested by the narrowing the population (and their views) through war, both conscribed and locally throughout the Blitz, and those same thoughts and feelings verified through the 1946-64 Baby Boom (which in the late 1960s turned into a \"Baby Bust\"). Songs like this one were considered unusual for the time, especially featuring on an album of this calibre, not only because it uses a lot of experimental and untested ideas, but because (like a lot of the other songs on the album) has a strong foreign indluence, with the droning of an Indian tambura used sporadically, which a music theorist might say is simply used to balance and link the tone of the verses with its repetition, and also showing how a seemingly unmatched and wide ensemble of different instruments can create an exciting harmony."
      },
      {
        "title": "Getting Better",
        "yt-id": "EGlo9LzmOME",
        "rating": 80,
        "reviewTitle": "Strikingly carries the album's tone",
        "reviewBody": "In contrast to the surrealism of the previous track, Getting Better's introduction and verses present a squeeky clean representation of the same type of social and idividual transformation that Lucy in the Sky presents, with sharp muted guitar chords, clean \"marching band\" style drums, revived Beatles' signature early lyrical style and vocal harmony (with call and response similar to With A Little Help From My Friends) - lyrics concisely describing the nostalia of childhood innocence and despisement of school life measured with question-answers of what an adult might consider necessary evils of education, but also metaphorically the early career of the Beatles: \"Filling me up with your rules\" could be a reference to the rules of the music industry and musical theory taught by producer George Martin, which had clearly been helping to improve each album release - On another level The Beatles' signature style was \"Getting Better\", the protagonist's personal situation is \"Getting Better\", and as an audience member who reflects on and understands the ideas and feelings portrayed, and can agree with the sentiments of things \"Getting Better\" over time - and fulfills the 3 levels of perspective (first, second, third person) through the use of this conceptual metaphor. Then in the bridge you get taken back to the surrealism of the previous track; representing the transition and change that the whole album presents as a social movement."
      },
      {
        "title": "Fixing A Hole",
        "yt-id": "UPBd8eHQqIw",
        "rating": 90,
        "reviewTitle": "Profoundly self-concious lyricism",
        "reviewBody": ""
      },
      {
        "title": "She's Leaving Home",
        "yt-id": "VaBPY78D88g",
        "rating": 75,
        "reviewTitle": "",
        "reviewBody": ""
      },
      {
        "title": "Being For The Benefit Of Mr. Kite!",
        "yt-id": "bJVWZy4QOy0",
        "rating": 65,
        "reviewTitle": "",
        "reviewBody": ""
      },
      {
        "title": "Within You Without You",
        "yt-id": "HsffxGyY4ck",
        "rating": 70,
        "reviewTitle": "",
        "reviewBody": ""
      },
      {
        "title": "When I'm Sixty-Four",
        "yt-id": "HCTunqv1Xt4",
        "rating": 85,
        "reviewTitle": "",
        "reviewBody": ""
      },
      {
        "title": "Lovely Rita",
        "yt-id": "ysDwR5SIR1Q",
        "rating": 85,
        "reviewTitle": "",
        "reviewBody": ""
      },
      {
        "title": "Good Morning Good Morning",
        "yt-id": "sjb9AxDkwAQ",
        "rating": 70,
        "reviewTitle": "",
        "reviewBody": ""
      },
      {
        "title": "Sgt. Pepper's Lonely Hearts Club Band (Reprise)",
        "yt-id": "aP47nqo2cf4",
        "rating": 75,
        "reviewTitle": "",
        "reviewBody": ""
      },
      {
        "title": "A Day In The Life",
        "yt-id": "UYeV7jLBXvA",
        "rating": 95,
        "reviewTitle": "",
        "reviewBody": ""
      }
    ]
  }
]





